# Задача-1: Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

x = input("Enter your name: ")
print(x)
age = int(input("Enter your age: "))
print(age)
z = float(input("Choose any number: "))
print("Nice to meet you " + x)